Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_TShapeProfile Properties
The IFC2X3_ParametricObject_TShapeProfile type exposes the following members.
Properties
Name | Description
Depth
 The depth.
Description
 The description of the product.
 (Inherited from ReferenceModelObjectAttribute.)
Extrusion
 The extrusion vector.
 (Inherited from ReferenceModelObjectAttribute.)
FilletRadius
 The fillet radius.
FlangeEdgeRadius
 The flange edge radius.
FlangeSlope
 The flange slope.
FlangeThickness
 The flange thickness.
FlangeWidth
 The flange width.
Name
 The name of the product.
 (Inherited from ReferenceModelObjectAttribute.)
ObjectType
 The object type of the product.
 (Inherited from ReferenceModelObjectAttribute.)
Origin
 The origin of the extrusion.
 (Inherited from ReferenceModelObjectAttribute.)
ProfileName
 The name of the profile (often empty).
 (Inherited from ReferenceModelObjectAttribute.)
WebEdgeRadius
 The web edge radius.
WebSlope
 The web slope.
WebThickness
 The web thickness.
xDir
 The X-axis direction.
 (Inherited from ReferenceModelObjectAttribute.)
Top
See Also
Reference
IFC2X3_ParametricObject_TShapeProfile Class
Tekla.Structures.Model.Collaboration Namespace